Core/src/DataProcessors/ЗагрузкаСпискаНоменклатурыРасширенная/ЗагрузкаСпискаНоменклатурыРасширенная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаСпискаНоменклатурыРасширенная</name>
  <attributes>
    <name>АдресВременногоХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВременногоФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДляЗагрузкиНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦенКонтрагента</name>
    <type>
      <types>CatalogRef.ВидыЦенКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗапасовРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодОценки</name>
    <type>
      <types>EnumRef.МетодОценкиЗапасов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаборСвойств</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ЦеныНоменклатурыКонтрагентов/ЦеныНоменклатурыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыКонтрагентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <comment>Цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЦенКонтрагента</name>
    <type>
      <types>CatalogRef.ВидыЦенКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <comment>Цена</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Актуальность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <attributes>
    <name>ВключаяХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/СпособыПополненияЗапасов/СпособыПополненияЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПополненияЗапасов</name>
  <enumValues>
    <name>Закупка</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Переработка</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Запас</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Операция</name>
  </enumValues>
  <enumValues>
    <name>ВидРабот</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасход</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/КатегорииНоменклатуры/КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>&lt;Без категории></description>
    </items>
  </predefined>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПоКлассификатору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристики</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНаценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/DataProcessors/ЗагрузкаСпискаНоменклатурыРасширенная/ObjectModule.bsl
Перем ДатаЗагрузки;

//////////////////////////////////////////////////////////////////////////////
// Сервисные функции и процедуры
//

// Запись на диск файла из временного хранилища
Функция ВыполнитьЗагрузкуДанныхИзВременногоХранилища(АдресВременногоХранилища) Экспорт
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		
		// получаем имя временного файла в локальной ФС на сервере
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xls");
		
		//Паганини_
		ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
		ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
		//_Паганини
		// получаем файл для считывания
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
	Исключение
		Сообщить(НСтр("ka='Не удалось создать файл на диске из временного хранилища!';ru='Не удалось создать файл на диске из временного хранилища!';en='Unable to create file on disk from the temporary storage!'"));
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		Возврат Ложь;
	КонецПопытки;
Возврат Истина;			
КонецФункции

// Удаление временного файла
Процедура УдалитьВременныйФайл()
	
	Попытка		
		Если Не ПустаяСтрока(ИмяВременногоФайла) Тогда
			УдалитьФайлы(ИмяВременногоФайла);
		КонецЕсли;
	Исключение
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
	КонецПопытки;
КонецПроцедуры

// Получить список страниц из файлов
Функция ПолучитьПереченьСтраниц(СтраницыИзФайла, АдресХранилища = Неопределено) Экспорт
	Если АдресХранилища = Неопределено Тогда 
		АдресХранилища = АдресВременногоХранилища;
	КонецЕсли;
	Если ПустаяСтрока(АдресХранилища) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	Если Не ВыполнитьЗагрузкуДанныхИзВременногоХранилища(АдресХранилища) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	//ვუერთდებით ექსელს
	Попытка
		Excel = новый COMОбъект("Excel.Application");
	Исключение
		Сообщить(НСтр("ka='როგორც ჩანს სერვერზე არ არის დაყენებული Microsoft Excel, გთხოვთ სცადოთ დაინსტალირების შემდეგ';ru='По всей видимости на сервере не установлен Microsoft Excel, повторите попытку после установки.';en='Apparently the server is not installed Microsoft Excel, try again after installation.'"));
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		Возврат Неопределено;
	КонецПопытки; 
	
	//მიერთებამ წარმატებით ჩაიარა, ვხსნით დროებითი ფაილს
	Попытка
		Excel.Workbooks.Open(ИмяВременногоФайла);
	Исключение
		Сообщить(НСтр("ka='ვერ მოხერხდა ფაილის გახსნა!';ru='Не удалось открыть файл!';en='Could not open file!'"));
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		Excel.Quit();
		Возврат Неопределено;
	КонецПопытки;	

	
	//Получим количество строк и колонок.
	//В разных версиях Excel получаются по-разному, поэтому сначала определим версию Excel
	Версия = Число(Лев(Excel.Version,Найти(Excel.Version,".")-1));
	
	Попытка
		ВсегоСтраниц = Excel.Worksheets.Count;
		Для ИндексСтраницы = 1 По ВсегоСтраниц Цикл 		
			Если Версия = 8 тогда
				ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
				ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
			Иначе
				ФайлСтрок   = Excel.WorkSheets(ИндексСтраницы).Cells(1,1).SpecialCells(11).Row;
				ФайлКолонок = Excel.WorkSheets(ИндексСтраницы).Cells(1,1).SpecialCells(11).Column;   
			Конецесли;
			СтрокаТаблицы = СтраницыИзФайла.Добавить();
			СтрокаТаблицы.Номер			= ИндексСтраницы;
			СтрокаТаблицы.Наименование	= Excel.WorkSheets(ИндексСтраницы).Name;
			СтрокаТаблицы.Строк			= ФайлСтрок;
			СтрокаТаблицы.Столбцов		= ФайлКолонок;
			СтрокаТаблицы.Используеться	= Ложь;			
		КонецЦикла;
	Исключение
		Сообщить(НСтр("ka='ვერ მოხერხდა ფაილის შიგთავსის დამუშავება!';ru='Не удалось обработать содержимое файла!';en='Unable to process the contents of the file!'"));
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		Excel.Quit();
		Возврат Неопределено;		
	КонецПопытки;
	
	//ექსელის გამორთვა
	Excel.ActiveWorkbook.Close();
	Excel.Quit();
	
	//დროებითი ფაილის წაშლა
	УдалитьВременныйФайл();	
КонецФункции

//////////////////////////////////////////////////////////////////////////////
// Функции и процедуры для создния объектов в ИБ 
//

Функция ПолучитьЗначениеСвойства(НаименованиеЗначения, СвойствоОбъекта)
	Результат = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(НаименованиеЗначения, , ,СвойствоОбъекта);
	Если Результат = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка() Тогда
		Результат = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
		Результат.Наименование = НаименованиеЗначения;
		Результат.Владелец = СвойствоОбъекта;
		Результат.Записать();				
	КонецЕсли;
Возврат Результат.Ссылка;
КонецФункции

Функция СоздатьНоменклатуру(ВыборкаЗапроса, ТаблицаНоменклатуры)
	
	Элемент = Справочники.Номенклатура.СоздатьЭлемент();
	
	//+++ Дмгг
	ПоискНоменклатурыПоАртикулу = ТаблицаНоменклатуры.НайтиСтроки(Новый Структура("Артикул", ВыборкаЗапроса.Артикул));
	Если ПоискНоменклатурыПоАртикулу.Количество() <> 0 Тогда 
		Сообщить(НСтр("ru = 'Номенклатура с артикулом: " + ВыборкаЗапроса.Артикул + ", уже существует'; ka = 'ნომეკლატურა არტიკულით" + ВыборкаЗапроса.Артикул + ",უკვე არსებობს'"));
		Возврат ПоискНоменклатурыПоАртикулу[0].Ссылка;
	КонецЕсли;
	//--- Дмгг
	
	ПоискРодителяПоНаименованию = Справочники.Номенклатура.НайтиПоНаименованию(ВыборкаЗапроса.Родитель,Истина);
	Если ПоискРодителяПоНаименованию = Неопределено ИЛИ ПоискРодителяПоНаименованию = Справочники.Номенклатура.ПустаяСсылка() Тогда 
		Элемент.Родитель			= ЭтотОбъект.ГруппаДляЗагрузкиНоменклатуры;
	Иначе
		Элемент.Родитель 			= ПоискРодителяПоНаименованию;
	КонецЕсли;
	
	//Паганини_
	//Элемент.НоменклатурнаяГруппа= ЭтотОбъект.НоменклатурнаяГруппа;
	Элемент.Артикул					= ВыборкаЗапроса.Артикул;
	Элемент.КатегорияНоменклатуры = Справочники.КатегорииНоменклатуры.БезКатегории;//ЭтотОбъект.НоменклатурнаяГруппа;
	//_Паганини
	Элемент.СчетУчетаЗапасов	= ЭтотОбъект.СчетУчетаЗапасов;
	Элемент.СчетУчетаЗатрат		= ЭтотОбъект.СчетУчетаЗатрат;
	//Паганини_
	Элемент.СчетУчетаЗапасовРегл	= ЭтотОбъект.СчетУчетаЗапасовРегл;
	Элемент.СчетУчетаЗатратРегл		= ЭтотОбъект.СчетУчетаЗатратРегл;
	//_Паганини
	Элемент.ЕдиницаИзмерения	= ЭтотОбъект.ЕдиницаИзмерения;
	Элемент.СтавкаНДС			= ЭтотОбъект.СтавкаНДС;
	
	
	Элемент.НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
	Элемент.СпособПополнения		= Перечисления.СпособыПополненияЗапасов.Закупка;
	Элемент.МетодОценки             = ЭтотОбъект.МетодОценки;
	Элемент.ТипНоменклатуры			= Перечисления.ТипыНоменклатуры.Запас;
	
	Элемент.Наименование		= ВыборкаЗапроса.Наименование;
	Элемент.НаименованиеПолное	= ВыборкаЗапроса.Наименование;
	Элемент.Поставщик           = ЭтотОбъект.Поставщик;
	
	Элемент.ИспользоватьХарактеристики = ЛОЖЬ;
	//+++ Дмгг
	Попытка
		Сообщить(НСтр("ru = 'Была создана номенклатура: " + ВыборкаЗапроса.Наименование +"/"+ ВыборкаЗапроса.Артикул +"'; ka = 'შეიქმნა ნომენკლატურა: " + ВыборкаЗапроса.Наименование +"/"+ ВыборкаЗапроса.Артикул +"'"));
		Элемент.Записать();
	Исключение
		Сообщить(НСтр("ru = 'Не удалось создать номенклатуру: " + ВыборкаЗапроса.Наименование +"/"+ ВыборкаЗапроса.Артикул +"'; ka = 'ვერ შეიქმნა ნომეკლატურა: " + ВыборкаЗапроса.Наименование +"/"+ ВыборкаЗапроса.Артикул +""));
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецПопытки;
	
	//+++ Дмгг
	НовСтрока = ТаблицаНоменклатуры.Добавить();
	НовСтрока.Ссылка = Элемент.Ссылка;
	НовСтрока.Артикул = Элемент.Ссылка.Артикул;
	//--- Дмгг
	
	Возврат Элемент.Ссылка;
	
КонецФункции

Функция СоздатьХарактеристику(Номенклатура, ВыборкаПоХарактеристикам)
	Характеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	
	Характеристика.Владелец = Номенклатура;
	Характеристика.Наименование = ВыборкаПоХарактеристикам.Размер;		
	
	//Паганини_
	//СтрокаСвойств = Характеристика.ДополнительныеРеквизиты.Добавить();
	//// у характеристики только одно свойство, в будущем будет более общий вариант
	//СвойствоХарактеристики = НоменклатурнаяГруппа.НаборСвойствХарактеристики.ДополнительныеРеквизиты[0].Свойство;
	//СтрокаСвойств.Свойство = СвойствоХарактеристики;
	//СтрокаСвойств.Значение = ПолучитьЗначениеСвойства(ВыборкаПоХарактеристикам.Размер, СвойствоХарактеристики);				
	//_Паганини
	
	Характеристика.Записать();
Возврат Характеристика.Ссылка;
КонецФункции

Функция ЗарегистрироватьШтрихКод(Номенклатура, ВыборкаПоХарактеристикам)
	
	Если ЗначениеЗаполнено(ВыборкаПоХарактеристикам.Штрихкод) Тогда 
	
	Запись = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьМенеджерЗаписи();
	Запись.Номенклатура		= Номенклатура;
	//Запись.Характеристика	= Характеристика;
	Запись.Штрихкод			= ВыборкаПоХарактеристикам.Штрихкод;
	//+++ Дмгг
	Попытка
		Запись.Записать();
		Сообщить(НСтр("ru = 'Добавлен штрихкод: "+ ВыборкаПоХарактеристикам.Штрихкод +"'; ka = 'დაემატა შტრიხკოდი "+ ВыборкаПоХарактеристикам.Штрихкод +"'"));
	Исключение
		Сообщить(НСтр("ru = 'Не удалось добавить штрихкод: " + ВыборкаПоХарактеристикам.Штрихкод + "'; ka = ''ვერ შეიქმნა შტრიხკოდი " + ВыборкаПоХарактеристикам.Штрихкод + "'"));
	КонецПопытки;
	//--- Дмгг
	КонецЕсли;
	
КонецФункции

Функция ЗарегистрироватьЦенуКонтрагента(Номенклатура, ВыборкаПоХарактеристикам)
	Если ЭтотОбъект.ВидЦенКонтрагента.Пустая() Тогда 
		Возврат Ложь;
	КонецЕсли;
	Запись = РегистрыСведений.ЦеныНоменклатурыКонтрагентов.СоздатьМенеджерЗаписи();
	Запись.Период = ДатаЗагрузки;	
	Запись.Номенклатура			= Номенклатура;
	//Запись.Характеристика		= Характеристика;
	Запись.ВидЦенКонтрагента	= ЭтотОбъект.ВидЦенКонтрагента;
	Запись.ЕдиницаИзмерения		= ЭтотОбъект.ЕдиницаИзмерения;
	Запись.Цена					= ВыборкаПоХарактеристикам.ЦенаЗакупки;
	//Запись.Записать();
	//+++ Дмгг
	Попытка
		Запись.Записать();
		Сообщить(НСтр("ru = 'Присвоена новая цена контрагента: "+ВыборкаПоХарактеристикам.ЦенаЗакупки+"'; ka = 'დაემატა მომწოდებლის ფასი "+ВыборкаПоХарактеристикам.ЦенаЗакупки+"'"));
	Исключение
		Сообщить(НСтр("ru = 'Не удалось добавить новую цену контрагента: " + ВыборкаПоХарактеристикам.ЦенаЗакупки + "'; ka = 'ვერ დაემატა მომწოდებლის ფასი " + ВыборкаПоХарактеристикам.ЦенаЗакупки + "'"));
	КонецПопытки;
	//--- Дмгг
	
	Возврат Истина;
	
КонецФункции

Функция ЗарегистрироватьЦенуРеализации(Номенклатура, ВыборкаПоХарактеристикам)
	
	Если ЭтотОбъект.ВидЦен.Пустая() Тогда 
		Возврат Ложь;
	КонецЕсли;
	Запись = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
	Запись.Период = ДатаЗагрузки;	
	Запись.Номенклатура			= Номенклатура;
	//Запись.Характеристика		= Характеристика;
	Запись.ВидЦен				= ЭтотОбъект.ВидЦен;
	Запись.ЕдиницаИзмерения		= ЭтотОбъект.ЕдиницаИзмерения;
	Запись.Цена					= ВыборкаПоХарактеристикам.ЦенаПродажи;
	//Запись.Записать();
	//+++ Дмгг
	Попытка
		Запись.Записать();
		Сообщить(НСтр("ru = 'Присвоена новая цена реализации: "+ВыборкаПоХарактеристикам.ЦенаПродажи+"'; ka = 'დაემატა გასაყიდი ფასი "+ВыборкаПоХарактеристикам.ЦенаПродажи+"'"));
	Исключение
		Сообщить(НСтр("ru = 'Не удалось добавить новую цену реализации: " + ВыборкаПоХарактеристикам.ЦенаПродажи + "'; ka = 'ვერ დაემატა გასაყიდი ფასი " + ВыборкаПоХарактеристикам.ЦенаПродажи + "'"));
	КонецПопытки;
	//--- Дмгг
	
	Возврат Истина;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////
// Функции и процедуры для обработки данных из файла 
//

// Обновление данных планов счетов
Функция ОбработкаДанныхИзФайла(СтраницыИзФайла, АдресХранилища = Неопределено) Экспорт
	Если АдресХранилища = Неопределено Тогда 
		АдресХранилища = АдресВременногоХранилища;
	КонецЕсли;
	Если ПустаяСтрока(АдресХранилища) ИЛИ (Не ВыполнитьЗагрузкуДанныхИзВременногоХранилища(АдресХранилища))	Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	// Запустим приложение EXCEL
	Попытка
		Excel = новый COMОбъект("Excel.Application");
	Исключение
		Сообщить(НСтр("ka='როგორც ჩანს სერვერზე არ არის დაყენებული Microsoft Excel, გთხოვთ სცადოთ დაინსტალირების შემდეგ';ru='По всей видимости на сервере не установлен Microsoft Excel, повторите попытку после установки.';en='Apparently the server is not installed Microsoft Excel, try again after installation.'"));
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		Возврат Неопределено;
	КонецПопытки; 
	
	// Откроем файл EXCEL-а 
	Попытка
		Excel.Workbooks.Open(ИмяВременногоФайла);
	Исключение
		Сообщить(НСтр("ka='ვერ მოხერხდა ფაილის გახსნა!';ru='Не удалось открыть файл!';en='Could not open file!'"));
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		Excel.Quit();
		Возврат Неопределено;
	КонецПопытки;	

	
	//Получим количество строк и колонок.
	//В разных версиях Excel получаются по-разному, поэтому сначала определим версию Excel
	Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);

	// Создание таблицы значений 
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Строка"));
	КС = Новый КвалификаторыСтроки(256, ДопустимаяДлина.Переменная);
	ОписаниеТипа = Новый ОписаниеТипов(Массив,,КС);
	
	МассивОТ = Новый Массив;
	МассивОТ.Добавить(Тип("Число"));
	Знак = ДопустимыйЗнак.Неотрицательный;
	КЧ = Новый КвалификаторыЧисла(10,0,Знак);
	ОписаниеТипаЧисло = Новый ОписаниеТипов(МассивОТ,,КЧ);
	
	// добавим в таблицу значений три колонки
	ТаблицаЗначений.Колонки.Добавить("НомерСтроки", ОписаниеТипаЧисло,"Номер строки");
	ТаблицаЗначений.Колонки.Добавить("Наименование", ОписаниеТипа,"Наименование");
	ТаблицаЗначений.Колонки.Добавить("НаименованиеПолное", ОписаниеТипа,"НаименованиеПолное");
	ТаблицаЗначений.Колонки.Добавить("Артикул", ОписаниеТипа,"Артикул");
	ТаблицаЗначений.Колонки.Добавить("Штрихкод", ОписаниеТипа,"Штрихкод");
	ТаблицаЗначений.Колонки.Добавить("Родитель", ОписаниеТипа,"Родитель");
	ТаблицаЗначений.Колонки.Добавить("ЦенаЗакупки", ОписаниеТипа,"Цена закупки");
	ТаблицаЗначений.Колонки.Добавить("ЦенаПродажи", ОписаниеТипа,"Цена продажи");
	
	//+++ Дмгг	
	// Для поиска номенклатуры по артикулу
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	Номенклатура.Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.Артикул <> """"";
	
	ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
	//--- Дмгг
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	 			   |	ВТДанныеИЗФайла.НомерСтроки,
	               |	ВТДанныеИЗФайла.Наименование,
	               |	ВТДанныеИЗФайла.НаименованиеПолное,
	               |	ВТДанныеИЗФайла.Артикул,
	               |	ВТДанныеИЗФайла.Штрихкод,
	               |	ВТДанныеИЗФайла.Родитель,
	               |	ВТДанныеИЗФайла.ЦенаЗакупки,
	               |	ВТДанныеИЗФайла.ЦенаПродажи
	               |ПОМЕСТИТЬ ВТТаблица
	               |ИЗ
	               |	&ВТДанныеИЗФайла КАК ВТДанныеИЗФайла
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |	ВТТаблица.НомерСтроки,
	               |	ВТТаблица.Наименование КАК Наименование,
	               |	ВТТаблица.НаименованиеПолное КАК НаименованиеПолное,
	               |	ВТТаблица.Артикул КАК Артикул,
	               |	ВТТаблица.Штрихкод КАК Штрихкод,
	               |	ВТТаблица.Родитель КАК Родитель,
	               |	ВТТаблица.ЦенаЗакупки КАК ЦенаЗакупки,
	               |	ВТТаблица.ЦенаПродажи КАК ЦенаПродажи
	               |ИЗ
	               |	ВТТаблица КАК ВТТаблица
				   |УПОРЯДОЧИТЬ ПО
				   |	НомерСтроки";
				   //|ИТОГИ
				   //|	МАКСИМУМ(ЦенаЗакупки),
				   //|	МАКСИМУМ(ЦенаПродажи)
				   //|ПО
				   //|	Наименование,
				   //|	НаименованиеПолное,
				   //|	Артикул,
				   //|	Родитель,
				   //|	Штрихкод";
	
	Попытка
		НачатьТранзакцию();					   
		ДатаЗагрузки = ТекущаяДата();					   
		Для Каждого Эл Из СтраницыИзФайла Цикл
			
			// Проверка по страницам
			Если Эл.Используеться = Ложь
				// Или Эл.Наименование <> "ОбновлениеПлановСчетов"
					Тогда 
				Продолжить;
			КонецЕсли;
			
			Сообщить(НСтр("ru = 'Чтение данных страницы: " + Эл.Наименование + "'; ka = 'მონაცემების დამუშავება: " + Эл.Наименование + "'"));
			
			ТаблицаЗначений.Очистить();
			// Обход страницы в файле и генерируем таблицу значений
			Для ИндексСтроки = 2 По Эл.Строк Цикл
	        	СтрокаТЗ = ТаблицаЗначений.Добавить();
				СтрокаТЗ["НомерСтроки"]			= ИндексСтроки;
				СтрокаТЗ["Наименование"]		= СокрЛП(Excel.Sheets(Эл.Номер).Cells(ИндексСтроки,1).Value);
				СтрокаТЗ["НаименованиеПолное"]	= СокрЛП(Excel.Sheets(Эл.Номер).Cells(ИндексСтроки,2).Value);
				СтрокаТЗ["Артикул"]				= СтрЗаменить(СтрЗаменить(СокрЛП(Excel.Sheets(Эл.Номер).Cells(ИндексСтроки,3).Value)," ", ""),Символы.НПП,"");
				СтрокаТЗ["Штрихкод"]			= СтрЗаменить(СтрЗаменить(СокрЛП(Excel.Sheets(Эл.Номер).Cells(ИндексСтроки,4).Value)," ", ""),Символы.НПП,"");
				СтрокаТЗ["Родитель"]			= СокрЛП(Excel.Sheets(Эл.Номер).Cells(ИндексСтроки,5).Value);
				СтрокаТЗ["ЦенаПродажи"]			= СтрЗаменить(СтрЗаменить(СокрЛП(Excel.Sheets(Эл.Номер).Cells(ИндексСтроки,6).Value)," ", ""),Символы.НПП,"");
				СтрокаТЗ["ЦенаЗакупки"]			= СтрЗаменить(СтрЗаменить(СокрЛП(Excel.Sheets(Эл.Номер).Cells(ИндексСтроки,7).Value)," ", ""),Символы.НПП,"");
			КонецЦикла;
			
			Запрос.УстановитьПараметр("ВТДанныеИЗФайла", ТаблицаЗначений);
			ВыборкаПоНоменклатуре = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоНоменклатуре.Следующий() Цикл 
				Если ВыборкаПоНоменклатуре.Наименование = Неопределено ИЛИ ПустаяСтрока(ВыборкаПоНоменклатуре.Наименование) Тогда 
					Продолжить;	
				КонецЕсли;

				Сообщить(НСтр("ru = 'Загрузка данных строки: " + ВыборкаПоНоменклатуре.НомерСтроки + "'; ka = 'მონაცემის ჩატვირთვა სტრიქონი: " + ВыборкаПоНоменклатуре.НомерСтроки + "'"));
				Номенклатура = СоздатьНоменклатуру(ВыборкаПоНоменклатуре, ТаблицаНоменклатуры);
				
				//ВыборкаПоХарактеристикам = ВыборкаПоНоменклатуре.Выбрать();
				//
				//Пока ВыборкаПоХарактеристикам.Следующий() Цикл 
				//	
				//	Характеристика = СоздатьХарактеристику(Номенклатура, ВыборкаПоХарактеристикам);
				
					ЗарегистрироватьШтрихКод(Номенклатура, ВыборкаПоНоменклатуре);
					
					ЗарегистрироватьЦенуКонтрагента(Номенклатура, ВыборкаПоНоменклатуре);
					
                    ЗарегистрироватьЦенуРеализации(Номенклатура, ВыборкаПоНоменклатуре);
					
				//КонецЦикла; // Конец обработки характеристик
			КонецЦикла; // Конец обработки номенклатуры
		КонецЦикла; // Конец обработки страницы из файла
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Сообщить(НСтр("ka='ვერ მოხერხდა ფაილის შიგთავსის დამუშავება!';ru='Не удалось обработать содержимое файла!';en='Unable to process the contents of the file!'"));
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		Excel.Quit();
		Возврат Неопределено;		
	КонецПопытки;
	
	// Закроем приложение EXCEL
	Excel.ActiveWorkbook.Close();
	Excel.Quit();
	
	// удалим временный файл созданный на сервере
	УдалитьВременныйФайл();	
КонецФункции


//////////////////////////////////////////////////////////////////////////////
// Функции и процедуры для генерации шаблонов файлов 
//

// Генерация шаблона для обновления данных планов счетов
Функция СгенерироватьШаблонДляФайлаИмпорта(УникальныйИдентификаторФормы) Экспорт 
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		
		Попытка
			Excel = новый COMОбъект("Excel.Application");
		Исключение
			Сообщить(НСтр("ka='როგორც ჩანს სერვერზე არ არის დაყენებული Microsoft Excel, გთხოვთ სცადოთ დაინსტალირების შემდეგ';ru='По всей видимости на сервере не установлен Microsoft Excel, повторите попытку после установки.';en='Apparently the server is not installed Microsoft Excel, try again after installation.'"));
			Ошибка = ОписаниеОшибки();
			Сообщить(Ошибка);
			Возврат Неопределено;
		КонецПопытки;
		
		Попытка
						
			Версия = Число(Лев(Excel.Version,Найти(Excel.Version,".")-1));
			
			Если Версия < 13 Тогда // если установлен 2003 и более ранний ексель то используем старый формат
				// получаем имя временного файла в локальной ФС на сервере
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xls");
			Иначе //иначе испорльзуем новый формат
				// получаем имя временного файла в локальной ФС на сервере
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");				
			КонецЕсли;
			
			КнигаExcel = Excel.WorkBooks.Add();
			Страница1 = КнигаExcel.WorkSheets.Add();
			ИмяСтраници =  НСтр("ka='ნომენკლატურის მონაცემები';ru='ДанныеПоНоменклатуре';en='Product info'");
			Страница1.Name = ИмяСтраници;
			//Страница1.Cells(1,1).Value = "'Артикул / наименование";
			//Страница1.Cells(1,2).Value = "'Штрихкод";
			//Страница1.Cells(1,3).Value = "'Размер";
			//Страница1.Cells(1,4).Value = "'Цена закупки";
			//Страница1.Cells(1,5).Value = "'Цена продажи";
			
			Наименование =   НСтр("ka='დასახელება';ru='Наименование';en='Name'");
			ПолноеНаименование =   НСтр("ka='სრული დასახელება';ru='Полное наименование';en='Full name'");
			Артикул =   НСтр("ka='არტიკული';ru='Артикул';en='Code'");
			Штрихкод =   НСтр("ka='შტრიხკოდი';ru='Штрихкод';en='Barcode'");
			Родитель =   НСтр("ka='მშობელი';ru='Родитель';en='Parent'");
			ЦенаПродажи =   НСтр("ka='გაყიდვის ფასი';ru='Цена продажи';en='Sale price'");
			ЦенаЗакупки =   НСтр("ka='შესყიდვის ფასი';ru='Цена закупки';en='Buying price'");
			
			Страница1.Cells(1,1).Value = Наименование;
			Страница1.Cells(1,2).Value = ПолноеНаименование;
			Страница1.Cells(1,3).Value = Артикул;
			Страница1.Cells(1,4).Value = Штрихкод;
			Страница1.Cells(1,5).Value = Родитель;
			Страница1.Cells(1,6).Value = ЦенаПродажи;
			Страница1.Cells(1,7).Value = ЦенаЗакупки;
			КнигаExcel.SaveAs(ИмяВременногоФайла);
			
			// Закроем приложение EXCEL
			Excel.ActiveWorkbook.Close();
			Excel.Quit();			
			
			Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификаторФормы);
			
			// удалим временный файл созданный на сервере 
			УдалитьВременныйФайл();			
		Исключение
			Сообщить(НСтр("ka='ვერ მოხერხდა ფაილის გახსნა!';ru='Не удалось создать файл!';en='Could not create file!'"));
			Ошибка = ОписаниеОшибки();
			Сообщить(Ошибка);
			Excel.Quit();
			Возврат Неопределено;
		КонецПопытки;
		
	Возврат Версия;	
	
	Исключение
		Сообщить(НСтр("ka='Не удалось создать файл на диске из временного хранилища!';ru='Не удалось создать файл на диске из временного хранилища!';en='Unable to create file on disk from the temporary storage!'"));
		Ошибка = ОписаниеОшибки();
		Сообщить(Ошибка);
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
